Autodesk.Revit.DB.ForgeTypeId.StrictlyEquals(Autodesk.Revit.DB.ForgeTypeId)
Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given
ForgeTypeId.
For the default equality comparison used by the equality operator (==), see
NameEquals(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.NameEquals(Autodesk.Revit.DB.ForgeTypeId)
Returns true if the typeid string held by this ForgeTypeId is equal to that held by the given ForgeTypeId,
excluding the version number. The version number of a typeid string follows a hyphen character. This function
compares the typeid strings up to the first hyphen. This is the default equality comparison method for the
ForgeTypeId class, used by the equality operator (==).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.Clear
Sets the typeId to an empty string
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.Empty
Checks if the typeId is an empty string
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ForgeTypeId.TypeId
The schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.GetHashCode
Returns the hash code for this ForgeTypeId
Returns:
A 32-bit signed integer hash code.
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.Equals(System.Object)
Determines whether this ForgeTypeId is equal to another.
other:
The ForgeTypeId with which to compare this ForgeTypeId.
Returns:
True if the given ForgeTypeId is equal to this one, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.#ctor(System.String)
Constructs a ForgeTypeId holding the given schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.#ctor
Constructs a ForgeTypeId holding an empty schema identifier.
Since:
2021

Autodesk.Revit.DB.ForgeTypeId
This class holds a string that uniquely identifies a Forge schema.
Since:
2021